# Machine Learning Foundation
## Pandas TimeSeries


### Overview: Time Series Data in Python
We will explore some key Time Series-realted functionality in the Numpy, Pandas and Matplotlib packages

### Key Data Types for Time Series Data

#### Key Numpy data types:
1. Array
2. datetime64
3. timedelta64

#### Key Pandas data types:
1. Series
2. DataFrame
3. Index

### Dataset Exploration Example

#### Set up

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
from datetime import datetime
from datetime import timedelta
from dateutil.relativedelta import relativedelta
from IPython.display import display
import os
os.chdir('data')
from colorsetup import colors, palette
sns.set_palette(palette)
# ignore warnings
warnings.filterwarnings('ignore')
pd.options.display.float_format = '{:,.1f}'.format
%matplotlib inline
plotsize = (13, 5)

#### Read in source data
It is often easiest to read data in as a Pandas DataFrame. Pandas provides a variety of __[Input/Output](https://pandas.pydata.org/pandas-docs/stable/reference/io.html)__ options to read files from common (.csv, .json) or proprietary (.xls, .sas7bdat) formats.

In [3]:
df=pd.read_excel("Sample - Superstore.xls")

In [4]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [9]:
df.shape

(9994, 21)

#### Simplify Time Series Data

In [6]:
variables=['Order Date', 'Category', 'Sales']
group_variables=variables[:2]
outcome_variable=variables[2]

In [8]:
df.groupby(group_variables)[outcome_variable].head()

0      262.0
1      731.9
2       14.6
3      957.6
4       22.4
        ...
9988   206.1
9989    25.2
9990    92.0
9991   258.6
9992    29.6
Name: Sales, Length: 7966, dtype: float64

In [11]:
df.groupby(group_variables)[outcome_variable].sum().reset_index()

     Order Date         Category   Sales
0    2011-01-04  Office Supplies    16.4
1    2011-01-05  Office Supplies   288.1
2    2011-01-06  Office Supplies    19.5
3    2011-01-07        Furniture 2,573.8
4    2011-01-07  Office Supplies   685.3
...         ...              ...     ...
2859 2014-12-30  Office Supplies   282.4
2860 2014-12-30       Technology   302.4
2861 2014-12-31        Furniture   323.1
2862 2014-12-31  Office Supplies   299.7
2863 2014-12-31       Technology    90.9

[2864 rows x 3 columns]

In [12]:
base=df.groupby(group_variables)[outcome_variable].sum().reset_index()

In [14]:
print("Columns:", base.columns)

Columns: Index(['Order Date', 'Category', 'Sales'], dtype='object')

In [15]:
print("Index:", base.index)

Index: RangeIndex(start=0, stop=2864, step=1)

In [16]:
base.head()

  Order Date         Category   Sales
0 2011-01-04  Office Supplies    16.4
1 2011-01-05  Office Supplies   288.1
2 2011-01-06  Office Supplies    19.5
3 2011-01-07        Furniture 2,573.8
4 2011-01-07  Office Supplies   685.3

In [18]:
base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2864 entries, 0 to 2863
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Order Date  2864 non-null   datetime64[ns]
 1   Category    2864 non-null   object
 2   Sales       2864 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 67.2+ KB

#### Working with Numpy Array

In [19]:
order_date=np.array(base['Order Date'])

In [20]:
category=np.array(base['Category'])

In [21]:
sales=np.array(base['Sales'])

In [22]:
print('Order Date', type(order_date), order_date.dtype)
print('Category', type(category), category.dtype)
print('Sales', type(sales), sales.dtype)

Order Date <class 'numpy.ndarray'> datetime64[ns]
Category <class 'numpy.ndarray'> object
Sales <class 'numpy.ndarray'> float64

In [23]:
df_from_numpy = pd.DataFrame({'Order Date':order_date, 'Category':category, 'Sales':sales})

In [24]:
df_from_numpy.head()

  Order Date         Category   Sales
0 2011-01-04  Office Supplies    16.4
1 2011-01-05  Office Supplies   288.1
2 2011-01-06  Office Supplies    19.5
3 2011-01-07        Furniture 2,573.8
4 2011-01-07  Office Supplies   685.3

#### datetime64 format in Numpy

In [26]:
order_date

array(['2011-01-04T00:00:00.000000000', '2011-01-05T00:00:00.000000000',
       '2011-01-06T00:00:00.000000000', ...,
       '2014-12-31T00:00:00.000000000', '2014-12-31T00:00:00.000000000',
       '2014-12-31T00:00:00.000000000'], dtype='datetime64[ns]')

In [27]:
order_date_daily = np.array(order_date, dtype='datetime64[D]')

In [28]:
order_date_daily

array(['2011-01-04', '2011-01-05', '2011-01-06', ..., '2014-12-31',
       '2014-12-31', '2014-12-31'], dtype='datetime64[D]')

In [29]:
order_date_monthly=np.array(order_date, dtype='datetime64[M]')

In [30]:
order_date_monthly

array(['2011-01', '2011-01', '2011-01', ..., '2014-12', '2014-12',
       '2014-12'], dtype='datetime64[M]')

In [31]:
np.unique(order_date_monthly)

array(['2011-01', '2011-02', '2011-03', '2011-04', '2011-05', '2011-06',
       '2011-07', '2011-08', '2011-09', '2011-10', '2011-11', '2011-12',
       '2012-01', '2012-02', '2012-03', '2012-04', '2012-05', '2012-06',
       '2012-07', '2012-08', '2012-09', '2012-10', '2012-11', '2012-12',
       '2013-01', '2013-02', '2013-03', '2013-04', '2013-05', '2013-06',
       '2013-07', '2013-08', '2013-09', '2013-10', '2013-11', '2013-12',
       '2014-01', '2014-02', '2014-03', '2014-04', '2014-05', '2014-06',
       '2014-07', '2014-08', '2014-09', '2014-10', '2014-11', '2014-12'],
      dtype='datetime64[M]')

In [32]:
len(np.unique(order_date_monthly))

48

### Working with the Pandas DatetimeIndex

In [33]:
print(base.head())
print('\n Unique categories:')
print(base['Category'].unique())

  Order Date         Category   Sales
0 2011-01-04  Office Supplies    16.4
1 2011-01-05  Office Supplies   288.1
2 2011-01-06  Office Supplies    19.5
3 2011-01-07        Furniture 2,573.8
4 2011-01-07  Office Supplies   685.3

 Unique categories:
['Office Supplies' 'Furniture' 'Technology']

#### Setting Index uisng existing variable

In [34]:
base.set_index('Order Date', inplace=True)
# Note that without inplace=True, it will output the results without changing the data

In [37]:
base.head()

                   Category   Sales
Order Date
2011-01-04  Office Supplies    16.4
2011-01-05  Office Supplies   288.1
2011-01-06  Office Supplies    19.5
2011-01-07        Furniture 2,573.8
2011-01-07  Office Supplies   685.3

In [38]:
print(base.index)
#print(base.index.unique())

DatetimeIndex(['2011-01-04', '2011-01-05', '2011-01-06', '2011-01-07',
               '2011-01-07', '2011-01-07', '2011-01-08', '2011-01-08',
               '2011-01-10', '2011-01-10',
               ...
               '2014-12-28', '2014-12-29', '2014-12-29', '2014-12-29',
               '2014-12-30', '2014-12-30', '2014-12-30', '2014-12-31',
               '2014-12-31', '2014-12-31'],
              dtype='datetime64[ns]', name='Order Date', length=2864, freq=None)

#### Subsetting data

In [40]:
# observations in 2014
print(base['2011'].head())
print('\n')

# observations in a range of dates, subset of columns:
print(base[base['Category']=='Office Supplies']['2011':'2012-02'].head())

                   Category   Sales
Order Date
2011-01-04  Office Supplies    16.4
2011-01-05  Office Supplies   288.1
2011-01-06  Office Supplies    19.5
2011-01-07        Furniture 2,573.8
2011-01-07  Office Supplies   685.3


                   Category  Sales
Order Date
2011-01-04  Office Supplies   16.4
2011-01-05  Office Supplies  288.1
2011-01-06  Office Supplies   19.5
2011-01-07  Office Supplies  685.3
2011-01-08  Office Supplies   10.4

#### Datetime component

In [41]:
#base.set_index('Order Date', inplace=True)
print('Day:', base.index.day, '\n')
print('Week:', base.index.week, '\n')
base['DayofWeek'] = base.index.dayofweek # Day of Week: Monday=0, Sunday=6
print(base.head())
# Note: use dt method when the date variable is not part of the index: 
# df['Order Date'].dt.dayofweek.head()
del(base['DayofWeek'])

Day: Int64Index([ 4,  5,  6,  7,  7,  7,  8,  8, 10, 10,
            ...
            28, 29, 29, 29, 30, 30, 30, 31, 31, 31],
           dtype='int64', name='Order Date', length=2864)

Week: Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  2,  2,
            ...
            52,  1,  1,  1,  1,  1,  1,  1,  1,  1],
           dtype='int64', name='Order Date', length=2864)

                   Category   Sales  DayofWeek
Order Date
2011-01-04  Office Supplies    16.4          1
2011-01-05  Office Supplies   288.1          2
2011-01-06  Office Supplies    19.5          3
2011-01-07        Furniture 2,573.8          4
2011-01-07  Office Supplies   685.3          4

### Standardizing the datetimeIndex

#### Pivoting Data
Pandas pivot method

In [42]:
base.head()

                   Category   Sales
Order Date
2011-01-04  Office Supplies    16.4
2011-01-05  Office Supplies   288.1
2011-01-06  Office Supplies    19.5
2011-01-07        Furniture 2,573.8
2011-01-07  Office Supplies   685.3

In [44]:
base.reset_index(inplace=True)

In [45]:
# Note if we didn't reset the index, we could use index=None
sales_pivot=base.pivot(index='Order Date', columns='Category', values='Sales')

In [47]:
sales_pivot.head()

Category    Furniture  Office Supplies  Technology
Order Date
2011-01-04        nan             16.4         nan
2011-01-05        nan            288.1         nan
2011-01-06        nan             19.5         nan
2011-01-07    2,573.8            685.3     1,147.9
2011-01-08       76.7             10.4         nan

#### Unstacking
The unstack method transform long data into wide data while stack does the reverse

In [49]:
sales=base.set_index(['Order Date', 'Category']).unstack('Category').fillna(0)

In [50]:
sales.head()

               Sales
Category   Furniture Office Supplies Technology
Order Date
2011-01-04       0.0            16.4        0.0
2011-01-05       0.0           288.1        0.0
2011-01-06       0.0            19.5        0.0
2011-01-07   2,573.8           685.3    1,147.9
2011-01-08      76.7            10.4        0.0

In [51]:
sales.columns=sales.columns.levels[1].rename(None)

In [52]:
sales.head()

            Furniture  Office Supplies  Technology
Order Date
2011-01-04        0.0             16.4         0.0
2011-01-05        0.0            288.1         0.0
2011-01-06        0.0             19.5         0.0
2011-01-07    2,573.8            685.3     1,147.9
2011-01-08       76.7             10.4         0.0

In [53]:
print(sales.index)
print('\nUnique dates in our data: ', len(sales.index.unique()), 'Days')

DatetimeIndex(['2011-01-04', '2011-01-05', '2011-01-06', '2011-01-07',
               '2011-01-08', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-14', '2011-01-15',
               ...
               '2014-12-22', '2014-12-23', '2014-12-24', '2014-12-25',
               '2014-12-26', '2014-12-27', '2014-12-28', '2014-12-29',
               '2014-12-30', '2014-12-31'],
              dtype='datetime64[ns]', name='Order Date', length=1238, freq=None)

Unique dates in our data:  1238 Days

#### Generating a complete index and setting frequency

In [54]:
print('\nUnique dates in our data: ', len(sales.index.unique()), 'Days')
our_date_range = sales.index.max() - sales.index.min()

# Calculate number of days in date range
print('Total days in our date range:', our_date_range.days, 'Days')
#date_range = pd.date_range(min(sales.index), max(sales.index))

Unique dates in our data:  1238 Days
Total days in our date range: 1457 Days

In [55]:
new_index = pd.date_range(sales.index.min(), sales.index.max())
print(new_index)

DatetimeIndex(['2011-01-04', '2011-01-05', '2011-01-06', '2011-01-07',
               '2011-01-08', '2011-01-09', '2011-01-10', '2011-01-11',
               '2011-01-12', '2011-01-13',
               ...
               '2014-12-22', '2014-12-23', '2014-12-24', '2014-12-25',
               '2014-12-26', '2014-12-27', '2014-12-28', '2014-12-29',
               '2014-12-30', '2014-12-31'],
              dtype='datetime64[ns]', length=1458, freq='D')

In [56]:
sales_new = sales.reindex(new_index, fill_value=0)

In [57]:
sales_new.index

DatetimeIndex(['2011-01-04', '2011-01-05', '2011-01-06', '2011-01-07',
               '2011-01-08', '2011-01-09', '2011-01-10', '2011-01-11',
               '2011-01-12', '2011-01-13',
               ...
               '2014-12-22', '2014-12-23', '2014-12-24', '2014-12-25',
               '2014-12-26', '2014-12-27', '2014-12-28', '2014-12-29',
               '2014-12-30', '2014-12-31'],
              dtype='datetime64[ns]', length=1458, freq='D')